In [ ]:
pandas >> python data analysis

In [1]:
import pandas as pd

## Steps for Data Science Project

In [ ]:
1. Problem Statement
2. Data Gathering
3. EDA >> Exploratory Data Analysis
4. Data Preprocessing
5. Feature Selection
6. Model training
7. Model Evaluation
8. Deployment(AWS, GCP, Azure)

In [ ]:
Two different stuctures are there in Pandas:
    1. Series(1-D)
    2. DataFrames(2-D)
    
Dataframes:
    1. Two dimentional data
    2. Data is in tabular form >> rows and columns
    
    Use cases:
        1. Reading excel/csv files we can also create csv and excel files.
        2. EDA >> visualization
        3. Data cleaning
        4. Encoding (One hot encoding, label encoding)
        5. feature selection
        
Columns in dataframes are also referred as features, variables or fields
Rows in dataframes are reffered as records, observations,index values.

## Different ways to create Dataframes

In [1]:
import pandas as pd

In [12]:
dict1 = {"name":["ashish","ashwini","pooja"],"location":["pune","nashik","Junnar"]}
dict1

{'name': ['ashish', 'ashwini', 'pooja'],
 'location': ['pune', 'nashik', 'Junnar']}

In [3]:
df = pd.DataFrame(dict1)
df

      name location
0   ashish     pune
1  ashwini   nashik
2    pooja   Junnar

In [4]:
data = {"name": ["ashish","ashlesha"],"age":[20,21]}
df = pd.DataFrame(data)
df

       name  age
0    ashish   20
1  ashlesha   21

In [5]:
data = {'Col A':[1,2,3,4,5], 'Col B':[11,22,33,44,55]}
data

{'Col A': [1, 2, 3, 4, 5], 'Col B': [11, 22, 33, 44, 55]}

In [6]:
a=pd.DataFrame(data) 
a

   Col A  Col B
0      1     11
1      2     22
2      3     33
3      4     44
4      5     55

In [7]:
df = pd.DataFrame(data)
df

   Col A  Col B
0      1     11
1      2     22
2      3     33
3      4     44
4      5     55

# Empty Dataframe

In [8]:
df1 = pd.DataFrame()
df1

Empty DataFrame
Columns: []
Index: []

In [9]:
df1

Empty DataFrame
Columns: []
Index: []

In [10]:
df1["name"]=["sarika","latish","ovi"]
df1

     name
0  sarika
1  latish
2     ovi

In [ ]:
emp_id,emp_name,salary

In [4]:
df2 = pd.DataFrame()

In [5]:
df2['Col A'] = [1, 2, 3, 4, 5]
df2

   Col A
0      1
1      2
2      3
3      4
4      5

In [6]:
df2["colB"] = [10,20,30,40,50]
df2

   Col A  colB
0      1    10
1      2    20
2      3    30
3      4    40
4      5    50

In [8]:
df2['Col B'] = [11, 22, 33,44,55]
df2

   Col A  colB  Col B
0      1    10     11
1      2    20     22
2      3    30     33
3      4    40     44
4      5    50     55

In [9]:
df2['Col C'] = 'Python'
df2

   Col A  colB  Col B   Col C
0      1    10     11  Python
1      2    20     22  Python
2      3    30     33  Python
3      4    40     44  Python
4      5    50     55  Python

In [11]:
df2['Col D'] = list('Pytho') # [p y t h o]
df2

   Col A  colB  Col B   Col C Col D
0      1    10     11  Python     P
1      2    20     22  Python     y
2      3    30     33  Python     t
3      4    40     44  Python     h
4      5    50     55  Python     o

In [ ]:
# create one empty data frame and 1)emp id,2) emp name 3) emp salary

In [13]:
dict1 = {"name":["ashish","ashwini","pooja"],"location":["pune","nashik","Junnar"]}
dict1

{'name': ['ashish', 'ashwini', 'pooja'],
 'location': ['pune', 'nashik', 'Junnar']}

In [15]:
series = pd.Series(dict1)
series

name        [ashish, ashwini, pooja]
location      [pune, nashik, Junnar]
dtype: object

In [16]:
df2['Col D'] = list('Pytho') # [p y t h o]
df2

   Col A  colB  Col B   Col C Col D
0      1    10     11  Python     P
1      2    20     22  Python     y
2      3    30     33  Python     t
3      4    40     44  Python     h
4      5    50     55  Python     o

In [17]:
df2["Cole"]= " "

In [18]:
df2

   Col A  colB  Col B   Col C Col D Cole
0      1    10     11  Python     P
1      2    20     22  Python     y
2      3    30     33  Python     t
3      4    40     44  Python     h
4      5    50     55  Python     o

In [ ]:
Pandas = Python Data Analysis
Structures of pandas  :-
1) Series (1D)
2) DataFrame (2D) - Rows and Columns 
3) How Create Dataframe

In [1]:
for i in range(2, 10, 2):

    print(i)

2
4
6
8

In [2]:
numbers = [1, 2, 3, 4, 5]

for num in numbers:

    print(num * 2)

2
4
6
8
10

In [3]:
nums = [1, 2, 3, 4, 5]

squared_nums = [num ** 2 for num in nums]

print(squared_nums)

[1, 4, 9, 16, 25]